app/controllers/comments_controller.rb

	def create
		@comment = Comment.new(comment_params)
		@comment.event_id = @event.id
		@comment.user_id = current_user.id

		if @comment.save
---
INSERT INTO "comments" ("reply", "created_at", "updated_at", "user_id", "event_id") VALUES (?, ?, ?, ?, ?)  [["reply", "i wanna join"], ["created_at", "2019-07-22 03:15:50.620078"], ["updated_at", "2019-07-22 03:15:50.620078"], ["user_id", 1], ["event_id", 13]]

	def update
		if@comment.update(comment_params)
---
UPDATE "comments" SET "reply" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["reply", "i wanna join ------ Jack"], ["updated_at", "2019-07-22 23:57:10.600415"], ["id", 1]]

	   def find_event
	   	  @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

	   def find_comment
	   	@comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]