app/controllers/events_controller.rb

	def index
		if params[:category].blank?
		  @events = Event.all.order("created_at DESC")
		else
		  @category_id = Category.find_by(name: params[:category]).id
		  @events = Event.where(:category_id => @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "events".* FROM "events" WHERE (LOWER(title) LIKE '%sfu%') ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Sports"], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."category_id" = ? ORDER BY created_at DESC  [["category_id", 1]]

	def new
		@event = current_user.events.build
		@categories = Category.all.map{ |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

	def create
		@event = current_user.events.build(event_params)
		@event.category_id = params[:category_id]

		if @event.save
---
INSERT INTO "events" ("title", "description", "location", "amount", "created_at", "updated_at", "user_id", "category_id", "event_img_file_name", "event_img_content_type", "event_img_file_size", "event_img_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def update
		@event.category_id = params[:category_id]
		if @event.update(event_params)
---
UPDATE "events" SET "description" = ?, "location" = ?, "amount" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "Chess game for SFU chess lovers"], ["location", "AQ 3154"], ["amount", "20"], ["updated_at", "2019-07-14 22:55:04.709135"], ["id", 6]]

    def find_event
    	@event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]