app/views/layouts/application.html.erb

                   <ul class="dropdown-menu" role="menu">
                         <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"